doc/BUILD/source/_static/soap_outputs/6.2.314.3321/create_package_from_json_step_6_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>DeleteObject</command>
      <object_list>
        <package_spec>
          <expire_seconds>660</expire_seconds>
          <display_name>Custom Tagging - Add Tags</display_name>
          <name>Custom Tagging - Add Tags API TEST</name>
          <modification_time>2015-09-05T05:04:25</modification_time>
          <creation_time>2015-09-05T05:04:25</creation_time>
          <verify_group_id>0</verify_group_id>
          <last_modified_by>Administrator</last_modified_by>
          <last_update>2015-09-05T05:04:25</last_update>
          <source_id>0</source_id>
          <hidden_flag>0</hidden_flag>
          <command>cmd /c cscript //T:60 add-tags.vbs "$1"</command>
          <command_timeout>60</command_timeout>
          <deleted_flag>0</deleted_flag>
          <available_time>1900-01-01T00:00:00</available_time>
          <id>146</id>
          <parameter_definition>{"parameters":[{"maxChars":0,"validationExpressions":[{"expression":"\\S","helpString":"You must enter a value","flags":"","model":"com.tanium.models::ValidationExpression","parameterType":"com.tanium.models::ValidationExpression"}],"label":"Add tags (space-delimited)","key":"$1","restrict":null,"value":"","helpString":"Enter tags space-delimited.","promptText":"e.g. PCI DMZ Decomm","defaultValue":"","parameterType":"com.tanium.components.parameters::TextInputParameter","model":"com.tanium.components.parameters::TextInputParameter"}],"model":"com.tanium.components.parameters::ParametersArray","parameterType":"com.tanium.components.parameters::ParametersArray"}</parameter_definition>
          <metadata>
            <item>
              <admin_flag>0</admin_flag>
              <name>defined</name>
              <value>Tanium</value>
            </item>
            <item>
              <admin_flag>0</admin_flag>
              <name>category</name>
              <value>Tanium</value>
            </item>
          </metadata>
        </package_spec>
      </object_list>
      <options></options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>